## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 14 to add, 0 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cartography_launcher_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cartography_launcher_lambda"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "iam:GetRole",
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecs:RunTask",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
            ]
        }
    }

  # data.template_file.cartography_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cartography_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [
                {
                  "name" : "cartography",
                  "cpu" : 0,
                  "environment" : [
                    {
                      "name" : "AWS_CONFIG_FILE",
                      "value" : "/config/role_config"
                    },
                    {
                      "name" : "NEO4J_URI",
                      "value" : "bolt://neo4j.internal.local:7687"
                    },
                    {
                      "name" : "NEO4J_USER",
                      "value" : "neo4j"
                    },
                  ],
                  "essential" : true,
                  "image" : "${CARTOGRAPHY_IMAGE}",
                  "logConfiguration" : {
                  "logDriver" : "awslogs",
                  "options" : {
                      "awslogs-group": "${AWS_LOGS_GROUP}",
                      "awslogs-region": "${AWS_LOGS_REGION}",
                      "awslogs-stream-prefix": "${AWS_LOGS_STREAM_PREFIX}"
                    }
                  },
                  "portMappings" : [
                    {
                      "hostPort" : 443,
                      "ContainerPort" : 443,
                      "Protocol" : "tcp"
                    }
                  ],
                  "secrets" : [
                    {
                      "name" : "NEO4J_SECRETS_PASSWORD",
                      "valueFrom" : "${NEO4J_SECRETS_PASSWORD}"
                    }
                  ],
                },
              ]
        EOT
      + vars     = {
          + "AWS_LOGS_GROUP"         = "/aws/ecs/cartography"
          + "AWS_LOGS_REGION"        = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX" = "cartography-task"
          + "CARTOGRAPHY_IMAGE"      = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cartography:latest"
          + "NEO4J_SECRETS_PASSWORD" = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password"
        }
    }

  # aws_cloudwatch_log_group.cartography will be created
  + resource "aws_cloudwatch_log_group" "cartography" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/cartography"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
    }

  # aws_ecs_cluster.cartography will be created
  + resource "aws_ecs_cluster" "cartography" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "cartography"
      + tags               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_task_definition.cartography will be created
  + resource "aws_ecs_task_definition" "cartography" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "4096"
      + execution_role_arn       = (known after apply)
      + family                   = "cartography"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole"
    }

  # aws_iam_policy.cartography_launcher_lambda will be created
  + resource "aws_iam_policy" "cartography_launcher_lambda" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CartographyLauncherLambdaRolePolicy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.cartography_policies must be replaced
-/+ resource "aws_iam_policy" "cartography_policies" {
      ~ arn       = "arn:aws:iam::794722365809:policy/CartographyTaskExecutionPolicies" -> (known after apply)
      ~ id        = "arn:aws:iam::794722365809:policy/CartographyTaskExecutionPolicies" -> (known after apply)
      ~ name      = "CartographyTaskExecutionPolicies" -> "CartographyContainerExecutionPolicies" # forces replacement
      ~ policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = "sts:AssumeRole"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:iam::722713121070:role/AssetInventorySecurityAuditRole",
                            "arn:aws:iam::028051698106:role/AssetInventorySecurityAuditRole",
                        ]
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "ecr:GetDownloadUrlForLayer",
                            "ecr:GetAuthorizationToken",
                            "ecr:BatchGetImage",
                            "ecr:BatchCheckLayerAvailability",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "ssm:GetParameters",
                            "ssm:DescribeParameters",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/elasticsearch_user",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/elasticsearch_password",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
                        ]
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ policy_id = "ANPA3SCJE6FYWALRFPSNL" -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.cartography_container_execution_role will be created
  + resource "aws_iam_role" "cartography_container_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ecs.amazonaws.com",
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                              + "lambda.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cartography_container_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.cartography_launcher_lambda will be created
  + resource "aws_iam_role" "cartography_launcher_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ecs-tasks.amazonaws.com",
                              + "lambda.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "Platform"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "Platform"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cartography_launcher_lambda will be created
  + resource "aws_iam_role_policy_attachment" "cartography_launcher_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Lambda"
    }

  # aws_iam_role_policy_attachment.cartography_launcher_lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "cartography_launcher_lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "Lambda"
    }

  # aws_iam_role_policy_attachment.cartography_launcher_lambda_vpc_service_role will be created
  + resource "aws_iam_role_policy_attachment" "cartography_launcher_lambda_vpc_service_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "Lambda"
    }

  # aws_iam_role_policy_attachment.cartography_launcher_lambda_xray_write will be created
  + resource "aws_iam_role_policy_attachment" "cartography_launcher_lambda_xray_write" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess"
      + role       = "Lambda"
    }

  # aws_iam_role_policy_attachment.cartography_policies must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cartography_policies" {
      ~ id         = "secopsAssetInventoryCartographyRole-20220426153157727700000006" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::794722365809:policy/CartographyTaskExecutionPolicies" -> (known after apply) # forces replacement
      ~ role       = "secopsAssetInventoryCartographyRole" -> "cartography_container_execution_role" # forces replacement
    }

  # aws_iam_role_policy_attachment.ce_cs will be created
  + resource "aws_iam_role_policy_attachment" "ce_cs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "cartography_container_execution_role"
    }

  # aws_lambda_function.cartography_launcher will be created
  + resource "aws_lambda_function" "cartography_launcher" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/launch_cartography.py.zip"
      + function_name                  = "launch_cartography"
      + handler                        = "lambda.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "HgMtukdbWGAv1XemYt3un7HH1nXybm+DgIEMtfcsNlI="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CARTOGRAPHY_ECS_NETWORKING"      = "subnet-009019231e9e7b90c"
              + "CARTOGRAPHY_ECS_SECURITY_GROUPS" = "sg-0146ac8de4816d72c"
              + "CARTOGRAPHY_ECS_TASK_DEF"        = "cartography"
            }
        }

      + tracing_config {
          + mode = "Active"
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0146ac8de4816d72c",
            ]
          + subnet_ids         = [
              + "subnet-009019231e9e7b90c",
            ]
          + vpc_id             = (known after apply)
        }
    }

Plan: 14 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

17 tests, 17 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
